tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling1D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

application=$(getApplication)

runApplication blockMesh
runApplication $application

if notTest $@
then
    foamDictionary system/controlDict -entry endTime -set 4
    foamDictionary system/controlDict -entry startTime -set 0.5
    foamDictionary 0.5/T.liquid -entry boundaryField.wall2.q -set 'uniform 500000'
    foamDictionary 0.5/T.liquid -entry boundaryField.wall1.q -set 'uniform 500000'
    foamDictionary 0.5/U.liquid -entry boundaryField.inlet.type -set 'fixedValue'
    runApplication -a $application
fi

#------------------------------------------------------------------------------
